# Задание:

*Написать программу, которая из имеющегося массива строк, формирует массив из строк,длина которых меньше,или равна 3 символа.*

*Первоначальный массив можно ввести с клавиатуры,либо задать на старте выполнения алгоритма.*

# Ход решения:

1. Создаем функцию GetArray для чтения массива с клавиатуры
2. Создаем подсказки для пользователя через Console.WriteLine
3. Создаем функцию PrintArray для того,чтоб увидеть наш массив
4. Основную задачу решаем в функции NewArray,тк в описании задачи написано "формирует", а не "выводит" => есть необходимость хранить новый массив,а не выводить его сразу